[
  {
    "id": 1,
    "title": "Class A share Hong Kong stock Labubu hidden money sold 1.08 million RMB! POP MART into a \"legal casino\"?",
    "slug": "class-a-share-hong-kong-stock-labubu-hidden-money-sold-1-08-million-rmb-pop-mart-into-a-legal-casino",
    "content": "Behind the success of POP MART ( 09992-HK ), it may be inseparable from the gambling psychology in human nature. The Chinese trendy gaming giant has created an amazing result of annual revenue exceeding 13 billion yuan RMB through the \"hidden blind box\" strategy with a chance of only 0.69%, which has attracted widespread attention from the market and society.\n\n\nHidden Labubu sold for 1.08 million RMB. (Photo: Shutterstock)\n\nRecently, the world's only mint Labubu was sold at auction for RMB 1.08 million yuan. This Labubu not only symbolizes scarcity and collection value, but also makes POP MART's hunger marketing strategy a global success.\n\n‌\nSimilar to high-quality luxury goods, the extremely low winning rate actually strengthens consumers' aesthetic recognition and brand loyalty towards the product.\n\nIn addition, the scarcity of hidden models not only stimulates consumers' appetite, but also amplifies the community's show-off psychology. Every time a player is lucky enough to win a rare model, they will post \"results\" on the community platform, further attracting more people to join the blind box army.\n\nTaking Labubu's third-generation hidden model as an example, the price on the second-hand trading platform skyrocketed to 2,799 yuan RMB , and the probability of winning was only 1/144. Many consumers even spent a lot of money on it, and the whole box was empty.\n\nThe \"Skinner box experiment\" in psychology has long revealed that random rewards are more addictive than fixed rewards. POP MART cleverly applies this principle to induce players to continue buying through uncertain odds of winning.\n\nNeuroscientific research has also confirmed that the level of dopamine secretion in the brain when winning a rare item is comparable to that in gambling, which is the physiological basis of the phenomenon of \"blind box addiction\".\n\nPOP MART's Tide Play Storm quickly swept the world. It was reported that physical conflicts broke out due to panic buying in British stores, and Singapore further required inbound passengers to declare blind boxes, reflecting the explosive growth of Tide Play consumption in the world and the policy response.\n\nPOP MART 2024 financial report shows that the annual revenue reached 13.038 billion yuan RMB , of which the overseas market contributed 5.066 billion yuan, an annual growth rate of 375.2%. South East Asia alone contributed 2.403 billion yuan, accounting for nearly half of overseas revenue. The North American market recorded an explosive growth of more than 500%.\n\nLabubu's THE MONSTERS series has become the company's strongest gold-absorbing product, with annual revenue of 3.04 billion yuan and an annual growth rate of 726.6%.\n\nHowever, the marketing strategy of POP MART has also caused a lot of controversy. At the annual meeting, well-known Chinese artist Guo Qilin even joked: \"Welcome to China's largest gaming company\", mocking the random lottery mechanism of POP MART blind box as highly similar to gambling.\n\nFacing the pressure of public opinion, POP MART founder Wang Ning clarified: \"We are the largest trendy play company in the world!",
    "imageUrl": "https://i.ibb.co/v6YcmswV/d4184d4aa3f34de975431796bbe5a3d6.webp",
    "publishedAt": "2025-06-14T00:00:00.000Z"
  },
  {
    "id": 2,
    "title": "POP MART | Labubu's new blind box series has been changed to a lottery for sale. Before registering at 4:00 pm, it has appeared in Renlong, incarnated as fried shrimp rice ball skewers, etc",
    "slug": "pop-mart-labubu-s-new-blind-box-series-has-been-changed-to-a-lottery-for-sale-before-registering-at-4-00-pm-it-has-appeared-in-renlong-incarnated-as-fried-shrimp-rice-ball-skewers-etc",
    "content": "Labubu, which is popular all over the world, has a new series of blind boxes. POP MART (09992) announced the launch of the \"THE MONSTERS WACKY MART\" series of figures and derivatives. It was originally on sale at 10:00 am this Friday (June 13), but POP MART pointed out at 2:00 pm on Thursday (June 12) that due to the expected bad weather conditions and safety considerations, the following new products of THE MONSTERS WACKY MART series will be sold by lottery. Guests can sign up on the official website or at designated branches from 4:00 pm on Thursday.\n\nRegistration opening time: 4:00 pm on June 12, 2025 (Thursday)\nRegistration closing time: 12 noon on June 13, 2025 (Friday)\nStart of lottery: 12:00 pm on June 13, 2025 (Friday)\nVerification and purchase time: The winner himself should arrive at the designated store for verification and purchase between 4:00 pm on June 13, 2025 (Friday) and 9:00 pm on June 16, 2025 (Monday). If he cannot go to the optional store to buy at the specified time, he will be deemed to have given up the purchase qualification.\n在新LABUBU盲盒開賣前，尖沙咀K11的POP MART已現人龍\n▲ Before the new LABUBU blind box goes on sale, the POP MART of K11 in Tsim Sha Tsui has already appeared.\n\nClick on the picture to enlarge\n\n\n\nAccording to the official released pictures, Labubu will be incarnated in fried shrimp, rice balls, milk, skewers, etc., and will also appear in cup noodles, potato chips, sandwiches, microwave ovens, etc.\n\nClick on the picture to enlarge\n\n\n\n\nBubble Mart refers to that each set of original boxes in the series contains 12 basic models, and there is 1 hidden model randomly hidden in the original box. On the day of sale, each person is limited to one original box, on a first-come, first-served basis, while stocks last.",
    "imageUrl": "https://i.ibb.co/xqvjF8T6/120625-45-iet-fish-v1-1024.jpg",
    "publishedAt": "2025-05-14T00:00:00.000Z"
  },
  {
    "id": 3,
    "title": "Dongguan pirated Labubu factory suddenly shut down to clear goods, or due to regulatory crackdowns",
    "slug": "Dongguan pirated Labubu factory suddenly shut down to clear goods, or due to regulatory crackdowns",
    "content": "Pop Mart (09992.HK)\n+5.800 (+2.174%)\nShort selling: HK$245 million; Ratio: 5.479% The Labubu dolls under its brand are selling like hotcakes globally. They are in short supply in many cities, which has led to the production of counterfeit Labubu dolls by mainland factories. Domestic media have discovered that recently, several factories in Dongguan that produce counterfeit Labubu dolls have suddenly stopped production, attracting market attention. Investigations show that counterfeiting factories have stopped production and cleared their inventory, which may be related to the strengthened copyright supervision by mainland law enforcement departments. The person in charge of a Dongguan factory that counterfeits Labubu dolls told domestic media reporters that their factory has currently halted the production of counterfeit Labubu products. At the same time, this person in charge has also changed the visible range of their WeChat Moments from \"visible daily\" to \"visible in the last six months\". In addition, on relevant social platforms, some personal accounts of factories that produce counterfeit Labubu dolls have deleted all the videos showing counterfeit Labubu dolls, without stating the reason.",
    "imageUrl": "https://i.ibb.co/PGF8cx2f/20250425092040077-l.jpg",
    "publishedAt": "2025-06-14T00:00:00.000Z"
  }
]